{
  "updated_at": "2026-03-02T08:53:27.943936+00:00",
  "government": [
    {
      "title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision Practices",
      "short_title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision…",
      "url": "https://doi.org/10.47191/etj/v11i02.27",
      "source": "Engineering and Technology Journal",
      "published_at": "2026-11-02T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Risk-based financial governance is becoming crucial for how institutions make investment decisions in today's markets. It involves assessing risks explicitly within oversight to align with organizational goals and responsibilities. This approach extends beyond traditional compliance by integrating risk into decision-making processes, using tools like scenario analysis and dynamic portfolio management. The literature shows that institutions with strong risk-based governance are better at anticipating market changes, optimizing performance, and ensuring sustainable value creation while staying compliant."
    },
    {
      "title": "The Impact of Digital Technology on International Humanitarian Law: Ethical and Legal Implications of Autonomous Weapons Systems",
      "short_title": "The Impact of Digital Technology on International Humanitarian Law: Ethical and Legal Implicat…",
      "url": "https://doi.org/10.24018/ejpolitics.2025.4.4.182",
      "source": "European Journal of Law and Political Science",
      "published_at": "2026-09-18T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "This article looks at how new technology like AI is changing international laws for wars. As weapons get more automated, it raises questions about who should be held responsible when they make decisions. The main idea is that current rules are still useful but need updating to fit with these new types of weapons. It suggests ways to improve the existing laws so that people in war zones can continue to rely on protections like not harming civilians unnecessarily."
    },
    {
      "title": "Working Behavior Of Government Officials In Public Services In Dutuno Village, Paleleh District, Buol Regency",
      "short_title": "Working Behavior Of Government Officials In Public Services In Dutuno Village, Paleleh Distric…",
      "url": "https://doi.org/10.37905/ppj.v6i2.2985",
      "source": "Public Policy Journal",
      "published_at": "2026-08-31T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This research looked at how government workers provide services in a village setting. They found that while the officials are polite to people, there are problems like being late or not responding quickly which affect how well they serve others. Showing care by helping with paperwork is good, but sometimes it takes too long and doesn't happen often enough. The biggest issue is following rules and showing up for work on time."
    },
    {
      "title": "Mars–Venus marriage: State-owned shareholders and corporate fraud in private firms",
      "short_title": "Mars–Venus marriage: State-owned shareholders and corporate fraud in private firms",
      "url": "https://doi.org/10.1016/j.jcae.2026.100544",
      "source": "Journal of Contemporary Accounting &amp; Economics",
      "published_at": "2026-08-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "The concept ‘light from light’ in the Nicene creed: Is the metaphor still appropriate for Christian ethics today?",
      "short_title": "The concept ‘light from light’ in the Nicene creed: Is the metaphor still appropriate for Chri…",
      "url": "https://doi.org/10.4102/ids.v60i2.3197",
      "source": "In die Skriflig/In Luce Verbi",
      "published_at": "2026-06-30T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This article explores the concept 'light from light' found in early Christian texts like the Nicene Creed. It asks if this metaphor is still relevant for modern Christian ethics, especially considering new ways of thinking about Jesus and his divinity. The author suggests that understanding this ancient metaphor can help create a broader vision of what it means to be human and how we should act ethically today. They argue that by examining the historical context and biblical perspectives, we can find ways to apply these ideas in practical ways for modern ethical discussions."
    },
    {
      "title": "Aviation accident investigation analysis methodologies used by 12 government Safety Investigation Authorities",
      "short_title": "Aviation accident investigation analysis methodologies used by 12 government Safety Investigat…",
      "url": "https://doi.org/10.1016/j.jsr.2026.02.001",
      "source": "Journal of Safety Research",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Governing Ethics for the Digital Transformation: Developing, Testing, and Validating a Framework",
      "short_title": "Governing Ethics for the Digital Transformation: Developing, Testing, and Validating a Framewo…",
      "url": "https://doi.org/10.1016/j.giq.2026.102117",
      "source": "Government Information Quarterly",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Corruption risk indicators in public procurement: Definition and evaluation with organised crime data",
      "short_title": "Corruption risk indicators in public procurement: Definition and evaluation with organised cri…",
      "url": "https://doi.org/10.1016/j.seps.2026.102429",
      "source": "Socio-Economic Planning Sciences",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Raising grievances to the state: The political economic effects of anti-corruption crackdowns on labor activism in China",
      "short_title": "Raising grievances to the state: The political economic effects of anti-corruption crackdowns…",
      "url": "https://doi.org/10.1016/j.jdeveco.2026.103758",
      "source": "Journal of Development Economics",
      "published_at": "2026-04-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Data Science as a Catalyst for Audit Transformation",
      "short_title": "Data Science as a Catalyst for Audit Transformation",
      "url": "https://doi.org/10.56251/clyp9463",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-03-02T07:07:38.767356+00:00",
      "sentiment": "positive",
      "plain_summary": "Data science has become crucial as we generate vast amounts of information daily. It helps transform this data into useful insights for better decision-making across various sectors. For audit institutions, integrating data science can enhance their ability to manage public funds more effectively and improve accountability. By using data science, audits can provide clearer and more accurate reports that recommend improvements faster, which benefits the overall administration and improves citizens' quality of life."
    },
    {
      "title": "Technology is Advancing Every Day, We Think Oversight Should Too!",
      "short_title": "Technology is Advancing Every Day, We Think Oversight Should Too!",
      "url": "https://doi.org/10.56251/tydf1981",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-03-02T07:07:38.767088+00:00",
      "sentiment": "positive",
      "plain_summary": null
    },
    {
      "title": "Killer Robots – A Case for SAIs",
      "short_title": "Killer Robots – A Case for SAIs",
      "url": "https://doi.org/10.56251/ojyp9121",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-03-02T07:07:38.767018+00:00",
      "sentiment": "positive",
      "plain_summary": "This paper discusses a scenario where autonomous killer robots are used in warfare without human intervention. These robots can make decisions about who to target based on AI algorithms trained to recognize certain uniforms. If one of these drones targets and kills an enemy soldier who is surrendering, it would violate international laws. Another concern is if the robot makes a mistake by attacking another similar system, leading to unintended conflicts."
    },
    {
      "title": "The dark side of public service motivation : Analysis of noble cause corruption based on the Lebanese case",
      "short_title": "The dark side of public service motivation : Analysis of noble cause corruption based on the L…",
      "url": "https://doi.org/10.3917/e.gmp.pr1.0018",
      "source": "Gestion et management public",
      "published_at": "2026-03-02T07:07:38.766626+00:00",
      "sentiment": "negative",
      "plain_summary": "This study examines how public service motivation can lead to noble cause corruption in Lebanon, where there's a lot of social and economic hardship. The research found that feelings like compassion and selflessness often push people into doing good deeds for noble causes, but these actions sometimes involve corrupt practices. This leads to internal conflicts as the person feels both guilty and supported by their work environment. Factors like physical exchanges, personal space in the workplace, and close relationships with users can make it easier for this type of corruption to happen."
    },
    {
      "title": "La face sombre de la motivation de service public : Analyse de la corruption pour une cause noble à partir du cas libanais",
      "short_title": "La face sombre de la motivation de service public : Analyse de la corruption pour une cause no…",
      "url": "https://doi.org/10.3917/gmp.pr1.0018",
      "source": "Gestion et management public",
      "published_at": "2026-03-02T07:07:38.766421+00:00",
      "sentiment": "negative",
      "plain_summary": "This study examines how public service motivation can lead to corruption for a noble cause in Lebanon, where corruption is prevalent and social issues are challenging. Based on interviews with 32 Lebanese public servants, the research explores how feelings of compassion and self-sacrifice related to public service motivation might encourage them to engage in corrupt behavior for what they see as a good cause. The study highlights that these motivations can lead to behaviors like providing extra support or shielding users from punishment. This can create internal conflicts within the public servant due to their emotional connection with those affected."
    },
    {
      "title": "Market Failure or Government Failure? A Response to Jaworski",
      "short_title": "Market Failure or Government Failure? A Response to Jaworski",
      "url": "https://doi.org/10.12747/bejr2013.01.08",
      "source": "Business Ethics Journal Review",
      "published_at": "2026-03-02T07:07:38.766100+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Perceived inequality and tax compliance in Ghana: the moderating roles of trust in governance, governance quality and corruption",
      "short_title": "Perceived inequality and tax compliance in Ghana: the moderating roles of trust in governance,…",
      "url": "https://doi.org/10.1108/ajems-07-2025-0531",
      "source": "African Journal of Economic and Management Studies",
      "published_at": "2026-03-02T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This research looks at how people feel about unfairness in Ghana and whether they pay their taxes. It found that when people think things are not fair, especially economically or socially, they are less likely to pay their taxes. The study also found that having trust in the government makes this effect stronger. However, good governance or fighting corruption did not have a big impact on how much unfairness affects tax compliance."
    },
    {
      "title": "The Colfax County War: Violence and Corruption in Territorial New Mexico by Corey Recko (review)",
      "short_title": "The Colfax County War: Violence and Corruption in Territorial New Mexico by Corey Recko (revie…",
      "url": "https://doi.org/10.1353/cwe.2026.a982930",
      "source": "The Journal of the Civil War Era",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approaches to AI training, ethics, and policy-making",
      "short_title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approache…",
      "url": "https://doi.org/10.1016/j.pubrev.2025.102664",
      "source": "Public Relations Review",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Perceived state capture and corruption regarding climate change: Links to mobilisation, perceptions, and climate action intentions",
      "short_title": "Perceived state capture and corruption regarding climate change: Links to mobilisation, percep…",
      "url": "https://doi.org/10.1016/j.jenvp.2026.102937",
      "source": "Journal of Environmental Psychology",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Corruption crimes in Ukraine and Lithuania under martial law and the state of emergency: situation and trends",
      "short_title": "Corruption crimes in Ukraine and Lithuania under martial law and the state of emergency: situa…",
      "url": "https://doi.org/10.1057/s41599-026-06547-y",
      "source": "Humanities and Social Sciences Communications",
      "published_at": "2026-02-28T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Re-assessing governmental corruption of religion: Where political theory meets empirical evidence",
      "short_title": "Re-assessing governmental corruption of religion: Where political theory meets empirical evide…",
      "url": "https://doi.org/10.1177/14687968261424659",
      "source": "Ethnicities",
      "published_at": "2026-02-28T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This study revisits the idea that when governments get involved with religious institutions, it often leads to corruption. It uses theories from thinkers like Locke and Jefferson along with modern scholars' ideas. The researchers looked at data from many countries over time to see how public trust in religious groups changes based on government support. They found that having exclusive state funding for religion can decrease people's confidence in religious organizations, especially among the majority believers."
    },
    {
      "title": "The Role of Investigators in the Handling of Corruption Cases",
      "short_title": "The Role of Investigators in the Handling of Corruption Cases",
      "url": "https://doi.org/10.30574/wjarr.2026.29.2.0446",
      "source": "World Journal of Advanced Research and Reviews",
      "published_at": "2026-02-28T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "Corruption can severely affect a country's economy and trust in its government. This study focuses on how prosecutors' investigators handle corruption cases in Maluku region. Investigators have strong legal grounds to conduct investigations according to laws. They follow steps like issuing warrants and collecting evidence."
    }
  ],
  "nonprofit": [
    {
      "title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision Practices",
      "short_title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision…",
      "url": "https://doi.org/10.47191/etj/v11i02.27",
      "source": "Engineering and Technology Journal",
      "published_at": "2026-11-02T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Risk-based financial governance is becoming crucial for how institutions make investment decisions in today's markets. It involves assessing risks explicitly within oversight to align with organizational goals and responsibilities. This approach extends beyond traditional compliance by integrating risk into decision-making processes, using tools like scenario analysis and dynamic portfolio management. The literature shows that institutions with strong risk-based governance are better at anticipating market changes, optimizing performance, and ensuring sustainable value creation while staying compliant."
    },
    {
      "title": "Recent Expansions in Anti-Microbial Profile of Quinoline Analogues: A Review",
      "short_title": "Recent Expansions in Anti-Microbial Profile of Quinoline Analogues: A Review",
      "url": "https://doi.org/10.2174/0113852728367743250520191343",
      "source": "Current Organic Chemistry",
      "published_at": "2026-11-01T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Recent research has shown that adding different parts called heterocyclic systems to quinoline molecules can create compounds with many useful properties. These modified quinoline-based drugs are effective against a wide range of harmful bacteria, including those causing serious infections. They also show promise in treating cancer and other conditions like seizures, pain, inflammation, and heart problems. By combining quinoline with other parts, scientists can make new medicines that work better than existing ones."
    },
    {
      "title": "Driving Governance Excellence in Non-Profit Organizations through Digital and Strategic Transformation",
      "short_title": "Driving Governance Excellence in Non-Profit Organizations through Digital and Strategic Transf…",
      "url": "https://doi.org/10.70122/ajbsp.v3i1.3",
      "source": "American Journal of Business Science Philosophy",
      "published_at": "2026-06-30T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "This study looks at what helps non-profits run better, focusing on four key areas: using digital tools effectively, being flexible with strategies, having strong relationships, and continuously learning. It found that all these elements are important for good governance in non-profits. By integrating technology, adapting quickly to changes, building trust among partners, and always seeking new knowledge, organizations can improve their performance significantly. This research provides practical advice for leaders on how to enhance their organization's governance and overall success."
    },
    {
      "title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approaches to AI training, ethics, and policy-making",
      "short_title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approache…",
      "url": "https://doi.org/10.1016/j.pubrev.2025.102664",
      "source": "Public Relations Review",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Fuzzy logic meets accountability and management: linguistic modeling of the compliance officer functions in nonprofit cooperative societies",
      "short_title": "Fuzzy logic meets accountability and management: linguistic modeling of the compliance officer…",
      "url": "https://doi.org/10.1007/s10700-026-09475-3",
      "source": "Fuzzy Optimization and Decision Making",
      "published_at": "2026-02-28T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This study focuses on defining the roles of a Compliance Officer in nonprofit cooperative societies using fuzzy logic to make assessments more flexible and understandable. It uses expert opinions weighted by importance based on standards like ISO 37301. The research involved multiple experts from Spanish organizations, which makes the findings stronger and less biased. While there are some limitations, such as potential uniformity among experts and challenges in applying results universally, this work helps improve accountability and management practices within these societies."
    }
  ]
}