{
  "updated_at": "2026-02-26T16:32:41.230967+00:00",
  "government": [
    {
      "title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision Practices",
      "short_title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision…",
      "url": "https://doi.org/10.47191/etj/v11i02.27",
      "source": "Engineering and Technology Journal",
      "published_at": "2026-11-02T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Risk-based financial governance is becoming crucial for how institutions make investment decisions in today's markets. It involves assessing risks explicitly within oversight to align with organizational goals and responsibilities. This approach extends beyond traditional compliance by integrating risk into decision-making processes, using tools like scenario analysis and dynamic portfolio management. The literature shows that institutions with strong risk-based governance are better at anticipating market changes, optimizing performance, and ensuring sustainable value creation while staying compliant."
    },
    {
      "title": "The Impact of Digital Technology on International Humanitarian Law: Ethical and Legal Implications of Autonomous Weapons Systems",
      "short_title": "The Impact of Digital Technology on International Humanitarian Law: Ethical and Legal Implicat…",
      "url": "https://doi.org/10.24018/ejpolitics.2025.4.4.182",
      "source": "European Journal of Law and Political Science",
      "published_at": "2026-09-18T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "This article looks at how new technology like AI is changing international laws for wars. As weapons get more automated, it raises questions about who should be held responsible when they make decisions. The main idea is that current rules are still useful but need updating to fit with these new types of weapons. It suggests ways to improve the existing laws so that people in war zones can continue to rely on protections like not harming civilians unnecessarily."
    },
    {
      "title": "Working Behavior Of Government Officials In Public Services In Dutuno Village, Paleleh District, Buol Regency",
      "short_title": "Working Behavior Of Government Officials In Public Services In Dutuno Village, Paleleh Distric…",
      "url": "https://doi.org/10.37905/ppj.v6i2.2985",
      "source": "Public Policy Journal",
      "published_at": "2026-08-31T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This research looked at how government workers provide services in a village setting. They found that while the officials are polite to people, there are problems like being late or not responding quickly which affect how well they serve others. Showing care by helping with paperwork is good, but sometimes it takes too long and doesn't happen often enough. The biggest issue is following rules and showing up for work on time."
    },
    {
      "title": "Mars–Venus marriage: State-owned shareholders and corporate fraud in private firms",
      "short_title": "Mars–Venus marriage: State-owned shareholders and corporate fraud in private firms",
      "url": "https://doi.org/10.1016/j.jcae.2026.100544",
      "source": "Journal of Contemporary Accounting &amp; Economics",
      "published_at": "2026-08-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "The concept ‘light from light’ in the Nicene creed: Is the metaphor still appropriate for Christian ethics today?",
      "short_title": "The concept ‘light from light’ in the Nicene creed: Is the metaphor still appropriate for Chri…",
      "url": "https://doi.org/10.4102/ids.v60i2.3197",
      "source": "In die Skriflig/In Luce Verbi",
      "published_at": "2026-06-30T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This article explores the concept 'light from light' found in early Christian texts like the Nicene Creed. It asks if this metaphor is still relevant for modern Christian ethics, especially considering new ways of thinking about Jesus and his divinity. The author suggests that understanding this ancient metaphor can help create a broader vision of what it means to be human and how we should act ethically today. They argue that by examining the historical context and biblical perspectives, we can find ways to apply these ideas in practical ways for modern ethical discussions."
    },
    {
      "title": "Aviation accident investigation analysis methodologies used by 12 government Safety Investigation Authorities",
      "short_title": "Aviation accident investigation analysis methodologies used by 12 government Safety Investigat…",
      "url": "https://doi.org/10.1016/j.jsr.2026.02.001",
      "source": "Journal of Safety Research",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Governing Ethics for the Digital Transformation: Developing, Testing, and Validating a Framework",
      "short_title": "Governing Ethics for the Digital Transformation: Developing, Testing, and Validating a Framewo…",
      "url": "https://doi.org/10.1016/j.giq.2026.102117",
      "source": "Government Information Quarterly",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Corruption risk indicators in public procurement: Definition and evaluation with organised crime data",
      "short_title": "Corruption risk indicators in public procurement: Definition and evaluation with organised cri…",
      "url": "https://doi.org/10.1016/j.seps.2026.102429",
      "source": "Socio-Economic Planning Sciences",
      "published_at": "2026-06-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Raising grievances to the state: The political economic effects of anti-corruption crackdowns on labor activism in China",
      "short_title": "Raising grievances to the state: The political economic effects of anti-corruption crackdowns…",
      "url": "https://doi.org/10.1016/j.jdeveco.2026.103758",
      "source": "Journal of Development Economics",
      "published_at": "2026-04-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "The Colfax County War: Violence and Corruption in Territorial New Mexico by Corey Recko (review)",
      "short_title": "The Colfax County War: Violence and Corruption in Territorial New Mexico by Corey Recko (revie…",
      "url": "https://doi.org/10.1353/cwe.2026.a982930",
      "source": "The Journal of the Civil War Era",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approaches to AI training, ethics, and policy-making",
      "short_title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approache…",
      "url": "https://doi.org/10.1016/j.pubrev.2025.102664",
      "source": "Public Relations Review",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Perceived state capture and corruption regarding climate change: Links to mobilisation, perceptions, and climate action intentions",
      "short_title": "Perceived state capture and corruption regarding climate change: Links to mobilisation, percep…",
      "url": "https://doi.org/10.1016/j.jenvp.2026.102937",
      "source": "Journal of Environmental Psychology",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Le facteur émotionnel de l’activité : analyser les « angles morts » pour améliorer la QVCT. Bilan d’une recherche immersive en Police Judiciaire française",
      "short_title": "Le facteur émotionnel de l’activité : analyser les « angles morts » pour améliorer la QVCT. Bi…",
      "url": "https://doi.org/10.3917/gmp.pr1.0009",
      "source": "Gestion et management public",
      "published_at": "2026-02-26T16:32:33.589300+00:00",
      "sentiment": "negative",
      "plain_summary": "This research focuses on understanding the emotional risks in police work and how they manage their emotions to improve job satisfaction. It was conducted by observing various police units like forensic science, digital investigation, financial division, criminal division, anti-terrorism unit, and more over 26 days. The study found two key emotions that are hard for them to express: interest and frustration. These emotions make it difficult for officers to discuss their work-related feelings openly, leading to invisible or undiscussed labor."
    },
    {
      "title": "Data Science as a Catalyst for Audit Transformation",
      "short_title": "Data Science as a Catalyst for Audit Transformation",
      "url": "https://doi.org/10.56251/clyp9463",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-02-26T16:32:32.659254+00:00",
      "sentiment": "positive",
      "plain_summary": "Data science has become crucial as we generate vast amounts of information daily. It helps transform this data into useful insights for better decision-making across various sectors. For audit institutions, integrating data science can enhance their ability to manage public funds more effectively and improve accountability. By using data science, audits can provide clearer and more accurate reports that recommend improvements faster, which benefits the overall administration and improves citizens' quality of life."
    },
    {
      "title": "Technology is Advancing Every Day, We Think Oversight Should Too!",
      "short_title": "Technology is Advancing Every Day, We Think Oversight Should Too!",
      "url": "https://doi.org/10.56251/tydf1981",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-02-26T16:32:32.659140+00:00",
      "sentiment": "positive",
      "plain_summary": null
    },
    {
      "title": "Killer Robots – A Case for SAIs",
      "short_title": "Killer Robots – A Case for SAIs",
      "url": "https://doi.org/10.56251/ojyp9121",
      "source": "International Journal of Government Auditing",
      "published_at": "2026-02-26T16:32:32.659102+00:00",
      "sentiment": "positive",
      "plain_summary": "This paper discusses a scenario where autonomous killer robots are used in warfare without human intervention. These robots can make decisions about who to target based on AI algorithms trained to recognize certain uniforms. If one of these drones targets and kills an enemy soldier who is surrendering, it would violate international laws. Another concern is if the robot makes a mistake by attacking another similar system, leading to unintended conflicts."
    },
    {
      "title": "The dark side of public service motivation : Analysis of noble cause corruption based on the Lebanese case",
      "short_title": "The dark side of public service motivation : Analysis of noble cause corruption based on the L…",
      "url": "https://doi.org/10.3917/e.gmp.pr1.0018",
      "source": "Gestion et management public",
      "published_at": "2026-02-26T16:32:32.658550+00:00",
      "sentiment": "negative",
      "plain_summary": "This study examines how public service motivation can lead to noble cause corruption in Lebanon, where there's a lot of social and economic hardship. The research found that feelings like compassion and selflessness often push people into doing good deeds for noble causes, but these actions sometimes involve corrupt practices. This leads to internal conflicts as the person feels both guilty and supported by their work environment. Factors like physical exchanges, personal space in the workplace, and close relationships with users can make it easier for this type of corruption to happen."
    },
    {
      "title": "La face sombre de la motivation de service public : Analyse de la corruption pour une cause noble à partir du cas libanais",
      "short_title": "La face sombre de la motivation de service public : Analyse de la corruption pour une cause no…",
      "url": "https://doi.org/10.3917/gmp.pr1.0018",
      "source": "Gestion et management public",
      "published_at": "2026-02-26T16:32:32.658465+00:00",
      "sentiment": "negative",
      "plain_summary": "This study examines how public service motivation can lead to corruption for a noble cause in Lebanon, where corruption is prevalent and social issues are challenging. Based on interviews with 32 Lebanese public servants, the research explores how feelings of compassion and self-sacrifice related to public service motivation might encourage them to engage in corrupt behavior for what they see as a good cause. The study highlights that these motivations can lead to behaviors like providing extra support or shielding users from punishment. This can create internal conflicts within the public servant due to their emotional connection with those affected."
    },
    {
      "title": "Market Failure or Government Failure? A Response to Jaworski",
      "short_title": "Market Failure or Government Failure? A Response to Jaworski",
      "url": "https://doi.org/10.12747/bejr2013.01.08",
      "source": "Business Ethics Journal Review",
      "published_at": "2026-02-26T16:32:32.658322+00:00",
      "sentiment": "negative",
      "plain_summary": null
    },
    {
      "title": "Perceptions of Political Corruption in State Government",
      "short_title": "Perceptions of Political Corruption in State Government",
      "url": "https://doi.org/10.1177/1532673x261420826",
      "source": "American Politics Research",
      "published_at": "2026-02-25T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This study looks at how people feel about corruption happening in different states of the US. It found that people can sometimes connect what they think with what's really happening. People also tend to see more corruption when the governor from their party isn't in power. The research shows that knowing a lot about politics doesn't change these perceptions much."
    },
    {
      "title": "CORRUPTION IN KAZAKHSTAN: SOCIO-ECONOMIC CONSEQUENCES AND IMPLICATIONS FOR PUBLIC ADMINISTRATION",
      "short_title": "CORRUPTION IN KAZAKHSTAN: SOCIO-ECONOMIC CONSEQUENCES AND IMPLICATIONS FOR PUBLIC ADMINISTRATI…",
      "url": "https://doi.org/10.47649/vau.25.v79.i4.36",
      "source": "Bulletin of the Khalel Dosmukhamedov Atyrau University",
      "published_at": "2026-02-25T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "Corruption is a major issue affecting Kazakhstan's economy and society. It leads to poor public services like healthcare and education, which makes life harder for people. Corruption also hurts investment by making it risky for businesses. This causes problems in infrastructure and innovation."
    },
    {
      "title": "Effect of Corruption on Human Development Across the Globe: Does Government Budget Transparency Play a Role?",
      "short_title": "Effect of Corruption on Human Development Across the Globe: Does Government Budget Transparenc…",
      "url": "https://doi.org/10.55482/jcim.2025.35767",
      "source": "Journal of Comparative International Management",
      "published_at": "2026-02-23T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This research looks at how much corruption affects a country's progress and well-being for its people over time. It found that more corruption leads to worse outcomes in areas like health, education, and income. However, when governments are transparent about their spending—letting citizens see where the money goes—it helps improve these negative effects even in places with high levels of corruption. This study shows how keeping government finances open can make a big difference in improving people's lives despite corruption being present."
    },
    {
      "title": "Constitutional Guarantee of Ecological Damage Restoration within the Environmental Corruption Nexus",
      "short_title": "Constitutional Guarantee of Ecological Damage Restoration within the Environmental Corruption…",
      "url": "https://doi.org/10.62264/ijccj.v2i2.258",
      "source": "Indonesian Journal of Crime and Criminal Justice",
      "published_at": "2026-02-22T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This study looks at how environmental damage caused by corruption is treated under Indonesian laws. It found that when environmental offenses are seen as part of corruption, it can be considered a financial loss for the government. This means they have more rights to recover from those responsible and restore the environment. The research suggests changing law enforcement practices so that not only fines but also seized assets can go towards restoring the environment directly, rather than just preventing future damage."
    },
    {
      "title": "Prosecution Authority of the Corruption Eradication Commission Prosecutor: What is Dualism in Prosecution?",
      "short_title": "Prosecution Authority of the Corruption Eradication Commission Prosecutor: What is Dualism in…",
      "url": "https://doi.org/10.62264/ijccj.v2i2.248",
      "source": "Indonesian Journal of Crime and Criminal Justice",
      "published_at": "2026-02-22T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "In Indonesia, there is usually one prosecutor for all cases, but for corruption specifically, a special body called KPK has its own authority to start investigations and trials. This dual system means that even though the Attorney General leads prosecutions in general, KPK can handle corruption cases independently without needing permission from them. This allows KPK to focus on fighting corruption more effectively while still following the overall rule of having only one prosecutor for most crimes."
    },
    {
      "title": "Reconstruction of Criminal Law Policy in Countering Corruption by the Prosecutor’s Office in the Program to Accelerate the Implementation of National Strategic Projects",
      "short_title": "Reconstruction of Criminal Law Policy in Countering Corruption by the Prosecutor’s Office in t…",
      "url": "https://doi.org/10.26623/jic.v11i1.13137",
      "source": "Jurnal Ius Constituendum",
      "published_at": "2026-02-22T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": "This study looks at how Indonesia's prosecutor's office is trying to speed up important national projects while also fighting corruption. The current policies focus too much on punishing people who might be corrupt, which isn't fair or effective. To fix this, the researchers suggest making new rules that balance stopping bad behavior with helping prevent it from happening in the first place. They propose creating a team within the prosecutor's office to protect these important projects and include more measures that don’t involve punishment but still help stop corruption."
    }
  ],
  "nonprofit": [
    {
      "title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision Practices",
      "short_title": "Review of Risk Based Financial Governance Literature Shaping Institutional Investment Decision…",
      "url": "https://doi.org/10.47191/etj/v11i02.27",
      "source": "Engineering and Technology Journal",
      "published_at": "2026-11-02T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Risk-based financial governance is becoming crucial for how institutions make investment decisions in today's markets. It involves assessing risks explicitly within oversight to align with organizational goals and responsibilities. This approach extends beyond traditional compliance by integrating risk into decision-making processes, using tools like scenario analysis and dynamic portfolio management. The literature shows that institutions with strong risk-based governance are better at anticipating market changes, optimizing performance, and ensuring sustainable value creation while staying compliant."
    },
    {
      "title": "Recent Expansions in Anti-Microbial Profile of Quinoline Analogues: A Review",
      "short_title": "Recent Expansions in Anti-Microbial Profile of Quinoline Analogues: A Review",
      "url": "https://doi.org/10.2174/0113852728367743250520191343",
      "source": "Current Organic Chemistry",
      "published_at": "2026-11-01T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "Recent research has shown that adding different parts called heterocyclic systems to quinoline molecules can create compounds with many useful properties. These modified quinoline-based drugs are effective against a wide range of harmful bacteria, including those causing serious infections. They also show promise in treating cancer and other conditions like seizures, pain, inflammation, and heart problems. By combining quinoline with other parts, scientists can make new medicines that work better than existing ones."
    },
    {
      "title": "Driving Governance Excellence in Non-Profit Organizations through Digital and Strategic Transformation",
      "short_title": "Driving Governance Excellence in Non-Profit Organizations through Digital and Strategic Transf…",
      "url": "https://doi.org/10.70122/ajbsp.v3i1.3",
      "source": "American Journal of Business Science Philosophy",
      "published_at": "2026-06-30T00:00:00+00:00",
      "sentiment": "positive",
      "plain_summary": "This study looks at what helps non-profits run better, focusing on four key areas: using digital tools effectively, being flexible with strategies, having strong relationships, and continuously learning. It found that all these elements are important for good governance in non-profits. By integrating technology, adapting quickly to changes, building trust among partners, and always seeking new knowledge, organizations can improve their performance significantly. This research provides practical advice for leaders on how to enhance their organization's governance and overall success."
    },
    {
      "title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approaches to AI training, ethics, and policy-making",
      "short_title": "Self-starters and lone rangers: Municipal government and nonprofit PR practitioners’ approache…",
      "url": "https://doi.org/10.1016/j.pubrev.2025.102664",
      "source": "Public Relations Review",
      "published_at": "2026-03-01T00:00:00+00:00",
      "sentiment": "negative",
      "plain_summary": null
    }
  ]
}